select tb1."ГРУППА",
       "Н_ЛЮДИ"."ИМЯ",
       "ФАМИЛИЯ",
       "ОТЧЕСТВО",
       "П_ПРКОК_ИД",
       "НАИМЕНОВАНИЕ",
       "ПРИЗНАК",
       "КОНЕЦ"
from "Н_УЧЕНИКИ" tb1

         join "Н_ЛЮДИ" ON "Н_ЛЮДИ"."ИД" = tb1."ЧЛВК_ИД"
         join "Н_ПЛАНЫ" on "Н_ПЛАНЫ"."ИД" = tb1."ПЛАН_ИД"
         join "Н_ФОРМЫ_ОБУЧЕНИЯ" on "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД" = "Н_ПЛАНЫ"."ФО_ИД"
                                        and "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная' or
                                    "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Заочная'
where exists(
              select 1
              from "Н_УЧЕНИКИ" tb2
              where tb2."ПРИЗНАК" = 'отчисл'
                and tb1."ИД" = tb2."ИД"
                and extract(year from tb1."КОНЕЦ") >= 2012
                and extract(day from tb1."КОНЕЦ") > 1
                and extract(month from tb1."КОНЕЦ") >= 9
          )