select "ГРУППА", (age("ДАТА_РОЖДЕНИЯ"))
from "Н_ЛЮДИ"
         inner join "Н_УЧЕНИКИ" НУ on НУ."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"

group by "ДАТА_РОЖДЕНИЯ", "ГРУППА"
having avg(age("ДАТА_РОЖДЕНИЯ")) > (select min(age("ДАТА_РОЖДЕНИЯ"))
                                    from "Н_ЛЮДИ"
                                    where "Н_ЛЮДИ"."ИД" in (
                                        select "ЧЛВК_ИД"
                                        from "Н_УЧЕНИКИ"
                                        where "Н_УЧЕНИКИ"."ГРУППА" = '1100'
                                    ))